Tekla.Structures.Model.RebarLegFace.OffsetTypeEnum
Specifies how the offset is to be applied.

Tekla.Structures.Model.RebarLegFace.OffsetTypeEnum.FROM_CONCRETE_COVER
From the concrete cover offset.

Tekla.Structures.Model.RebarLegFace.OffsetTypeEnum.FROM_PREVIOUS_LAYER
The gap to the previous layer.

Tekla.Structures.Model.RebarLegFace.OffsetTypeEnum.FROM_LEGFACE_BAR_EDGE
From the legface to the edge of the bar.

Tekla.Structures.Model.RebarLegFace.OffsetTypeEnum.FROM_LEGFACE_BAR_CENTER
From the legface to the center of the bar.